app/views/compras/index.html.erb

                            <% @produto.each do |produto| %>
                            <% Produtoimagem.where(:produto_id => produto.id).find do |image| %>
---
SELECT `produtoimagems`.* FROM `produtoimagems` WHERE `produtoimagems`.`produto_id` = 105