app/views/produtos/index.html.erb

                            <% @produto.each do |produto| %>
                            <% Produtoimagem.where(:produto_id => produto.id).find do |image| %>
---
SELECT `produtoimagems`.* FROM `produtoimagems` WHERE `produtoimagems`.`produto_id` = 93

                            <tbody>
                                <% Produto.where(:user_id => cookies[:user_id], :visivel => "0").find do |produto| %>
---
SELECT `produtos`.* FROM `produtos` WHERE `produtos`.`user_id` = 0 AND `produtos`.`visivel` = 0