app/views/produtos/index.html.erb

                        <tbody>
                            <% Produto.where(:user_id => current_user.id).find_each do |produto| %>
---
SELECT  `produtos`.* FROM `produtos` WHERE `produtos`.`user_id` = 1 ORDER BY `produtos`.`id` ASC LIMIT 1000