app/controllers/compras_controller.rb

SELECT `produtos`.* FROM `produtos` WHERE (titulo LIKE '%%' AND visivel > 0) ORDER BY created_at DESC
---
  def index
    @produto = Produto.where('titulo LIKE ? AND visivel > 0', "%#{params[:tituloBusc]}%")

SELECT  `produtos`.* FROM `produtos` WHERE (id = '117') LIMIT 11
---
  def nova
    @comprador = cookies.signed[:user_id]
    prod = Produto.where('id = ?', params[:idproduto]).take