app/controllers/denuncia_controller.rb

  def new

    @produtoimagem = Produtoimagem.where(:produto_id => params[:id]).take

    @produto = Produto.where(:id => params[:id]).take
---
SELECT  `produtoimagems`.* FROM `produtoimagems` WHERE `produtoimagems`.`produto_id` = 19 LIMIT 1
SELECT  `produtos`.* FROM `produtos` WHERE `produtos`.`id` = 19 LIMIT 1