app/controllers/endereco_controller.rb

SELECT  `users`.* FROM `users` WHERE (id = NULL) LIMIT 1
INSERT INTO `enderecos` (`rua`, `numero`, `complemento`, `cep`, `bairro`, `cidade`, `created_at`, `updated_at`) VALUES ('Rua 7 de Setembro, 829', '829', '829', '98150-000', '123123', 'Pinhal Grande', '2019-05-21 19:47:15', '2019-05-21 19:47:15')
SELECT  `enderecos`.* FROM `enderecos` ORDER BY created_at DESC LIMIT 1
UPDATE `users` SET `enderecoID` = 13, `updated_at` = '2019-05-21 21:13:47' WHERE `users`.`id` = 16
---
    def create
        user = User.find_by("id = ?", $iduser)
        @endereco = Endereco.new(endereco_params)
        if (user.present?)
          @endereco.save
          @end = Endereco.order("created_at").last
          user.update_attribute(:enderecoID, @end.id)