app/controllers/forgotpwds_controller.rb

SELECT `forgotpwds`.* FROM `forgotpwds`
---
  def index
    @forgotpwds = Forgotpwd.all

SELECT  `users`.* FROM `users` WHERE (LOWER(email) = 'ticoduro@gmail.com') LIMIT 1
---
  def create
    @user = User.find_by("LOWER(email) = ?", user_params[:email].downcase)