app/controllers/homes_controller.rb

SELECT  `homes`.* FROM `homes` WHERE `homes`.`id` = NULL LIMIT 1
---
    def set_home
      @home = Home.find(params[:id])