app/controllers/produtos_controller.rb

SELECT `produtos`.* FROM `produtos`
---
  def index
    if (cookies[:user_id].blank?)
      redirect_to sessions_path
    else
      @produto = Produto.all