app/controllers/produtos_controller.rb

  def show

    @produtoimagem = Produtoimagem.where(:produto_id => params[:id]).take

    @produto = Produto.where(:id => params[:id]).take

    @venda = Venda.where(:idproduto => params[:id]).take

    @comprador = User.where(:id => @venda.idcomprador).take
---
SELECT  `produtoimagems`.* FROM `produtoimagems` WHERE `produtoimagems`.`produto_id` = 9 LIMIT 1
SELECT  `produtos`.* FROM `produtos` WHERE `produtos`.`id` = NULL LIMIT 1
SELECT  `vendas`.* FROM `vendas` WHERE `vendas`.`idproduto` = 8 ORDER BY `vendas`.`id` ASC LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` IN (10, 17, 17, 8, 0) LIMIT 1
SELECT  `vendas`.`idcomprador` FROM `vendas` WHERE `vendas`.`idproduto` = 9 ORDER BY `vendas`.`id` ASC LIMIT 1

  def index
    if (cookies[:user_id].blank?)
      redirect_to sessions_path
    else
      @produto = Produto.where(:user_id => cookies.signed[:user_id], :visivel => '1')
---
SELECT `produtos`.* FROM `produtos` WHERE `produtos`.`user_id` = 0 AND `produtos`.`visivel` = 0

  def create
    @produto = Produto.new(produto_params)
    @produto.visivel = '1'
    @produto.user_id = cookies.signed[:user_id]

    if @produto.save
        params[:produtoimagem]['imagem'].each do |a|
            uploader = ImageUploader.new
            uploader.store!(a)
            produtoimagens = Produtoimagem.new
            produtoimagens.produto_id = @produto.id
            produtoimagens.imagem = a
            produtoimagens.save!
---
INSERT INTO `produtos` (`titulo`, `autores`, `edicao`, `data_pub`, `isbn`, `editora`, `created_at`, `updated_at`, `user_id`, `visivel`) VALUES ('Pau no cu do surdo', 'Meu pau', 1, '10/10/10', '1234567891234', 'Sua mãe', '2019-05-30 01:48:59', '2019-05-30 01:48:59', 17, 1)
SELECT  `produtoimagems`.* FROM `produtoimagems` WHERE `produtoimagems`.`produto_id` = 49 LIMIT 1
INSERT INTO `produtoimagems` (`produto_id`, `created_at`, `updated_at`, `imagem`) VALUES (90, '2019-05-30 06:31:23', '2019-05-30 06:31:23', '\"001_-_SWtA8Ti.jpg\"')

  def destroy
    @produto = Produto.find(params[:id])
    @produto.destroy
---
SELECT  `produtos`.* FROM `produtos` WHERE `produtos`.`id` IS NULL LIMIT 1
DELETE FROM `produtos` WHERE `produtos`.`id` = 105

  def set_produto
    @produto = Produto.find(params[:id])
---
SELECT `produtos`.* FROM `produtos` WHERE `produtos`.`id` IN (NULL, NULL)