app/controllers/produtoimagems_controller.rb

  def index
    @produtoimagems = Produtoimagem.all
---
SELECT `produtoimagems`.* FROM `produtoimagems`