app/controllers/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE (LOWER(email) = 'chico@email.com') LIMIT 1
---
  def create
    @user = User.find_by("LOWER(email) = ?", user_params[:email].downcase)