app/controllers/signup_controller.rb

INSERT INTO `users` (`nome`, `email`, `zap`, `created_at`, `updated_at`, `password_digest`, `endereco`, `user_level`) VALUES ('Chica da Silva', 'chica@email.com', '(00) 00000-0000', '2019-04-22 03:24:47', '2019-04-22 03:24:47', '$2a$10$eInpAuBcWPBuW9cRzTUFku26ZVeOwwFxO8kvFwmmD0qjSD8eicSXm', 'rua rua', 5)
---
  def create
    @user = User.new(user_params)
    @user.user_level = '5'

    if @user.save