app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
---
  def index
    if (cookies[:user_id].blank?)
      redirect_to sessions_path
    else
      @users = User.all

INSERT INTO `users` (`nome`, `email`, `zap`, `created_at`, `updated_at`) VALUES ('Willian Denner Soares', 'moita.l2wok@gmail.com', '000000', '2019-03-16 03:42:50', '2019-03-16 03:42:50')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save